#**#Mastering SQLite3 in Python: Creating Connections and Listing Tables Jupyter Notebook**

In [2]:
#Import the necessary libraries

import pandas as pd
import sqlite3 as sql3

#1. Creating Connection

In [3]:
#Creating a connection object using **connect()** method,
database = "/content/drive/MyDrive/sqlite_dbs /thr-gendered-babynames.sqlite"
connection = sql3.connect(database)

#2. SQlite Table Listing

In [4]:
# Created one SQLite query with which we will search a list
# of all tables which are present inside the sqlite3 database.
sql_query = """
            SELECT name
            FROM sqlite_master
            WHERE type='table';
            """

In [5]:
#3. Using Connection Object, we are creating a cursor object.
cursor = connection.cursor()

In [16]:
# 4. Using execute() methods, we will execute the above SQL query.
cursor.execute(sql_query)

In [17]:
#5. Finally, We will print a list of all tables which are present inside the sqlite3 database.
print('The list of tables are:\n', cursor.fetchall())

The list of tables are:
 [('gendered_names',), ('thr_power_list',)]

# 3. Exploration of tables

In [29]:
# Exploring the "gendered_names" table

g_names_query =  """
          SELECT *
          FROM gendered_names
          LIMIT 5;
         """

In [33]:
# Reading the query with pandas
df_g_names = pd.read_sql_query(g_names_query, connection)
df_g_names.head()

,year,state,name,total_babies,primary_sex,primary_sex_ratio,per_100k_in_state
0,2015,US,Noah,19648,M,99.3,535.6
1,2015,US,Liam,18302,M,99.9,498.9
2,2015,US,Mason,16626,M,99.5,453.2
3,2015,US,Jacob,15838,M,99.9,431.8
4,2015,US,William,15824,M,99.9,431.4

In [34]:
# Exploring the "thr_power_list" table
tp_list_query =  """
          SELECT *
          FROM thr_power_list
          LIMIT 5;
         """

In [35]:
# Reading the query with pandas
df_tp_list = pd.read_sql_query(tp_list_query, connection)
df_tp_list.head()

,rank,full_name,first_name,last_name,occupation,company
0,100,Lin-Manuel Miranda,Lin-Manuel,Miranda,Actor/creator,Hamilton
1,99,Chris Pratt,Chris,Pratt,Actor,
2,98,Jason Blum,Jason,Blum,Founder/CEO,Blumhouse Productions
3,97,Robert Downey Jr.,Robert,Downey,Actor/director/producer,
4,96,Neal Moritz,Neal,Moritz,Producer,